package program;

/**
 * 1) Реализовать виртуальный класс, содержащий чистые виртуальные функции, функционал которых различается для наследников.
 * 2) Реализовать функционал, предусмотренный вариантом.
 * 3) Реализовать возможность создания однотипных БД (все объекты одного типа) и гибридных БД через интерфейс СУБД.
 * 4) Реализовать функционал добавления, удаления, сортировки записей для однотипных и гибридных БД через интерфейс СУБД. Обращение к БД осуществляется по имени БД.
 * 5) Реализовать возможность открытия и сохранения существующих БД через интерфейс СУБД.
 * 6) Реализовать возможность выборки по правилу (значению поля) записей БД и сохранения выборки как новой БД через интерфейс СУБД.
 * 7) Реализовать возможность вывода на экран записей БД через интерфейс СУБД.
 * 8) Предусмотреть в интерфейсе СУБД команду вывода списка существующих БД.
 * 9) Предусмотреть обработку исключительных ситуаций.
 */
public class Program {

    //Базы данных хранятся в одной неизменной папке с программой
    public static void main(String[] args) {

    }
}
